In [1]:
# dependencies

import pandas as pd
from sqlalchemy import create_engine

## Further data clean up

In [2]:
# file paths

weather_file_1 = 'Resources/avg_min_temp.csv'
weather_file_2 = 'Resources/avg_max_temp.csv'
population_file = 'Resources/StatePopulation.csv'
smoking_file = 'Resources/New_Tobacco.csv'

In [3]:
# store csv's into dataframes

weather_min_df = pd.read_csv(weather_file_1)
weather_max_df = pd.read_csv(weather_file_2)
population_df = pd.read_csv(population_file)
smoking_df = pd.read_csv(smoking_file)

In [4]:
weather_min_df.head()

         State  Avg Min Temp (째F)
0       Hawaii              65.09
1      Florida              61.50
2    Louisiana              56.07
3        Texas              54.16
4  Mississippi              52.26

In [5]:
# renaming headers to match sql database

weather_min_df = weather_min_df.rename(columns={"State": "state", "Avg Min Temp (째F)": "avg_min_temp"})
weather_min_df.head()

         state  avg_min_temp
0       Hawaii         65.09
1      Florida         61.50
2    Louisiana         56.07
3        Texas         54.16
4  Mississippi         52.26

In [6]:
weather_max_df = weather_max_df.rename(columns={"State": "state", "Avg Max Temp (째F)": "avg_max_temp"})
weather_max_df.head()

       state  avg_max_temp
0    Florida         81.97
1     Hawaii         80.66
2    Arizona         80.59
3      Texas         77.73
4  Louisiana         77.33

In [7]:
# joining weather max and min to make one DF

weather_df = pd.merge(weather_min_df, weather_max_df, on='state')
weather_df.head()

         state  avg_min_temp  avg_max_temp
0       Hawaii         65.09         80.66
1      Florida         61.50         81.97
2    Louisiana         56.07         77.33
3        Texas         54.16         77.73
4  Mississippi         52.26         74.67

In [8]:
weather_df.dtypes

state            object
avg_min_temp    float64
avg_max_temp    float64
dtype: object

In [9]:
population_df.head()

        State  Population
0     Alabama   4712651.0
1      Alaska    691189.0
2     Arizona   6246816.0
3    Arkansas   2872684.0
4  California  36637290.0

In [10]:
# renaming headers to match sql database

population_df = population_df.rename(columns={"State": "state", "Population": "population"})
population_df.head()

        state  population
0     Alabama   4712651.0
1      Alaska    691189.0
2     Arizona   6246816.0
3    Arkansas   2872684.0
4  California  36637290.0

In [11]:
population_df.dtypes

state          object
population    float64
dtype: object

In [12]:
smoking_df.head()

         State Smoke everyday Smoke some days Former smoker Never smoked
0  Puerto Rico          7.50%           4.40%        17.30%       70.80%
1       Nevada         16.50%           4.90%        25.80%       52.80%
2    Louisiana         15.90%           6.20%           22%          56%
3   California          7.50%           4.60%        23.10%       64.80%
4       Kansas         11.90%           5.10%        24.20%       58.80%

In [13]:
# split % from smoke values 

split_1 = smoking_df['Smoke everyday'].str.split('%', n=1, expand=True)
split_2 = smoking_df['Smoke some days'].str.split('%', n=1, expand=True)
split_3 = smoking_df['Former smoker'].str.split('%', n=1, expand=True)
split_4 = smoking_df['Never smoked'].str.split('%', n=1, expand=True)


smoking_df['smoke_everyday'] = split_1[0]
smoking_df['smoke_somedays'] = split_2[0]
smoking_df['smoke_former'] = split_3[0]
smoking_df['smoke_never'] = split_4[0]


smoking_df.drop(columns=['Smoke everyday'], inplace=True)
smoking_df.drop(columns=['Smoke some days'], inplace=True)
smoking_df.drop(columns=['Former smoker'], inplace=True)
smoking_df.drop(columns=['Never smoked'], inplace=True)

smoking_df.head()

         State smoke_everyday smoke_somedays smoke_former smoke_never
0  Puerto Rico           7.50           4.40        17.30       70.80
1       Nevada          16.50           4.90        25.80       52.80
2    Louisiana          15.90           6.20           22          56
3   California           7.50           4.60        23.10       64.80
4       Kansas          11.90           5.10        24.20       58.80

In [14]:
# renaming headers to match sql database

smoking_df = smoking_df.rename(columns={"State": "state"})
smoking_df.head()

         state smoke_everyday smoke_somedays smoke_former smoke_never
0  Puerto Rico           7.50           4.40        17.30       70.80
1       Nevada          16.50           4.90        25.80       52.80
2    Louisiana          15.90           6.20           22          56
3   California           7.50           4.60        23.10       64.80
4       Kansas          11.90           5.10        24.20       58.80

In [15]:
smoking_df.dtypes

state             object
smoke_everyday    object
smoke_somedays    object
smoke_former      object
smoke_never       object
dtype: object

In [16]:
smoking_df['smoke_everyday'] = pd.to_numeric(smoking_df['smoke_everyday'])

In [17]:
smoking_df['smoke_somedays'] = pd.to_numeric(smoking_df['smoke_somedays'])

In [18]:
smoking_df['smoke_former'] = pd.to_numeric(smoking_df['smoke_former'])

In [19]:
smoking_df['smoke_never'] = pd.to_numeric(smoking_df['smoke_never'])

In [20]:
smoking_df.dtypes

state              object
smoke_everyday    float64
smoke_somedays    float64
smoke_former      float64
smoke_never       float64
dtype: object

In [21]:
smoking_states = smoking_df["state"].unique()
smoking_states

array(['Puerto Rico', 'Nevada', 'Louisiana', 'California', 'Kansas',
       'Massachusetts', 'Arkansas', 'New Jersey', 'New York', 'Arizona',
       'Vermont', 'Alabama', 'Idaho', 'Wisconsin', 'Virginia', 'Michigan',
       'Ohio', 'Illinois', 'Connecticut', 'Maine', 'Iowa',
       'North Carolina', 'Colorado', 'Utah', 'Tennessee', 'Oklahoma',
       'Indiana', 'Wyoming', 'Florida', 'West Virginia', 'South Carolina',
       'Oregon', 'New Hampshire', 'Delaware', 'Hawaii', 'Texas',
       'Minnesota', 'Pennsylvania', 'New Mexico', 'Rhode Island',
       'Alaska', 'Missouri', 'Washington', 'Georgia', 'Nebraska',
       'North Dakota', 'District of Columbia', 'South Dakota',
       'Mississippi', 'Montana', 'Kentucky', 'Maryland',
       'Nationwide (States, DC, and Territories)',
       'Nationwide (States and DC)', 'Guam', 'Virgin Islands'],
      dtype=object)

In [22]:
population_states = population_df["state"].unique()
population_states

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [23]:
len(smoking_states)

56

In [24]:
len(population_states)

51

In [25]:
# create new smoking table with inner join on population table so that states match

new_smoking_df = pd.merge(smoking_df, population_df, on='state')
new_smoking_df.head()

,state,smoke_everyday,smoke_somedays,smoke_former,smoke_never,population
0,Nevada,16.5,4.9,25.8,52.8,2633331.0
1,Louisiana,15.9,6.2,22.0,56.0,4429940.0
2,California,7.5,4.6,23.1,64.8,36637290.0
3,Kansas,11.9,5.1,24.2,58.8,2809329.0
4,Massachusetts,10.2,3.9,29.3,56.6,6477096.0

In [26]:
new_smoking_states = new_smoking_df["state"].unique()
len(new_smoking_states)

51

In [27]:
new_smoking_df = new_smoking_df[['state', 'smoke_everyday', 'smoke_somedays', 'smoke_former', 'smoke_never']]
new_smoking_df.head()

           state  smoke_everyday  smoke_somedays  smoke_former  smoke_never
0         Nevada            16.5             4.9          25.8         52.8
1      Louisiana            15.9             6.2          22.0         56.0
2     California             7.5             4.6          23.1         64.8
3         Kansas            11.9             5.1          24.2         58.8
4  Massachusetts            10.2             3.9          29.3         56.6

## Uploading to PGAdmin

In [28]:
# connect to local database

rds_connection_string = "usr1:password@localhost:5432/final_smoking_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [29]:
# check for tables

engine.table_names()

['state_population', 'state_weather', 'state_smoking']

In [30]:
# use pandas to load dataframes onto smoking_db

population_df.to_sql(name='state_population', con=engine, if_exists='append', index=False)

In [31]:
pd.read_sql_query('select * from state_population', con=engine).head()

        state  population
0     Alabama     4712651
1      Alaska      691189
2     Arizona     6246816
3    Arkansas     2872684
4  California    36637290

In [32]:
weather_df.to_sql(name='state_weather', con=engine, if_exists='append', index=False)

In [33]:
pd.read_sql_query('select * from state_weather', con=engine).head()

         state  avg_min_temp  avg_max_temp
0       Hawaii         65.09         80.66
1      Florida         61.50         81.97
2    Louisiana         56.07         77.33
3        Texas         54.16         77.73
4  Mississippi         52.26         74.67

In [34]:
new_smoking_df.to_sql(name='state_smoking', con=engine, if_exists='append', index=False)

In [35]:
pd.read_sql_query('select * from state_smoking', con=engine).head()

           state  smoke_everyday  smoke_somedays  smoke_former  smoke_never
0         Nevada            16.5             4.9          25.8         52.8
1      Louisiana            15.9             6.2          22.0         56.0
2     California             7.5             4.6          23.1         64.8
3         Kansas            11.9             5.1          24.2         58.8
4  Massachusetts            10.2             3.9          29.3         56.6

## Load Database

In [37]:
# load table containing all all rows from 3 tables joined on State

pd.read_sql_query('select p.state, p.population, w.avg_min_temp, w.avg_max_temp,\
    s.smoke_everyday, s.smoke_somedays, s.smoke_former, s.smoke_never\
    from state_population as p\
    left join state_weather as w on p.state=w.state\
    left join state_smoking as s on w.state=s.state',con=engine).head(51)

,state,population,avg_min_temp,avg_max_temp,smoke_everyday,smoke_somedays,smoke_former,smoke_never
0,Nevada,2633331,42.75,71.64,16.5,4.9,25.8,52.8
1,Louisiana,4429940,56.07,77.33,15.9,6.2,22.0,56.0
2,California,36637290,48.97,73.36,7.5,4.6,23.1,64.8
3,Kansas,2809329,42.72,66.58,11.9,5.1,24.2,58.8
4,Massachusetts,6477096,37.63,58.61,10.2,3.9,29.3,56.6
5,Arkansas,2872684,48.72,71.42,17.3,5.6,24.1,53.0
6,New Jersey,8721577,41.45,62.40,10.2,4.2,26.1,59.4
7,New York,19229752,38.34,58.01,10.5,5.0,26.8,57.8
8,Arizona,6246816,51.31,80.59,10.7,4.4,27.9,57.1
9,Vermont,624258,32.96,54.48,11.1,4.2,30.7,54.0
10,Alabama,4712651,51.01,74.31,15.6,6.3,23.9,54.2
11,Idaho,1526797,33.29,59.31,11.3,4.4,22.9,61.5
12,Wisconsin,5637947,34.44,54.96,13.6,5.5,26.3,54.6
13,Virginia,7841754,44.26,66.77,14.5,4.0,24.4,57.0
14,Michigan,9952687,36.73,56.48,13.5,5.4,25.3,55.7
15,Ohio,11512431,40.79,60.94,17.1,5.4,24.6,52.9
16,Illinois,12745359,41.18,61.51,11.5,5.4,23.6,59.5
17,Connecticut,3545837,37.95,59.27,9.2,4.0,29.2,57.6
18,Maine,1327665,32.53,53.65,13.9,4.3,30.2,51.6
19,Iowa,3016267,37.67,58.57,12.1,4.1,23.4,60.4
20,North Carolina,9271178,47.21,70.16,14.3,5.4,24.5,55.8
21,Colorado,4887061,31.65,60.84,11.4,4.6,24.7,59.3
22,Utah,2657236,36.27,62.85,6.4,2.7,14.3,76.6
23,Tennessee,6234968,46.90,69.30,15.7,4.4,22.9,57.0
24,Oklahoma,3675339,48.17,72.04,17.5,6.2,24.3,52.0
25,Indiana,6417398,41.65,61.91,16.3,5.0,25.1,53.7
26,Wyoming,545579,29.22,57.63,14.9,4.6,24.6,55.9
27,Florida,18511620,61.50,81.97,12.0,5.2,29.8,53.0
28,West Virginia,1840802,41.61,64.51,23.2,3.6,24.4,48.8
29,South Carolina,4511428,49.82,73.58,14.0,7.0,24.1,54.9
30,Oregon,3761925,40.11,62.36,11.0,4.1,28.2,56.7
31,New Hampshire,1313939,33.23,55.69,12.4,4.5,30.7,52.4
32,Delaware,881278,44.21,64.62,12.8,4.5,26.8,56.0
33,Hawaii,1333591,65.09,80.66,10.7,3.8,25.3,60.2
34,Texas,24311891,54.16,77.73,10.5,5.3,21.3,62.9
35,Minnesota,5241914,32.49,53.41,11.3,3.6,25.9,59.2
36,Pennsylvania,12612705,39.29,60.31,13.4,5.0,26.2,55.4
37,New Mexico,2013122,37.46,68.66,11.4,7.1,24.7,56.9
38,Rhode Island,1056389,39.02,59.56,10.9,4.8,28.4,55.9
39,Alaska,691189,24.23,39.80,13.5,6.8,26.1,53.6
40,Missouri,5922314,43.84,65.53,16.6,4.4,26.1,52.8
41,Washington,6561297,40.76,60.09,11.0,4.2,25.5,59.3
42,Georgia,9468815,50.69,73.90,12.8,4.8,23.1,59.3
43,Nebraska,1799125,37.82,61.91,12.5,4.7,25.2,57.6
44,North Dakota,659858,29.38,52.13,12.2,5.1,24.1,58.6
45,District of Columbia,584400,44.54,65.02,10.0,5.7,23.4,61.0
46,South Dakota,799462,33.78,57.26,11.3,4.1,27.0,57.6
47,Mississippi,2941991,52.26,74.67,17.1,5.8,22.0,55.0
48,Montana,973739,31.05,57.27,13.5,5.3,27.2,54.0
49,Kentucky,4285828,44.25,66.98,19.3,5.5,26.0,49.2
50,Maryland,5696423,44.19,65.08,10.5,4.7,23.9,60.9